experiments/results/logs/periodic-hpa-008/wrk2.txt
Running 10m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 5814.188ms, rate sampling interval: 15482ms
  Thread calibration: mean lat.: 4898.873ms, rate sampling interval: 14704ms
  Thread calibration: mean lat.: 4910.099ms, rate sampling interval: 15024ms
  Thread calibration: mean lat.: 5881.375ms, rate sampling interval: 15482ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.52m     1.77m    7.10m    70.53%
    Req/Sec     6.93      3.36    14.00     86.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.08m 
 75.000%    5.78m 
 90.000%    6.34m 
 99.000%    6.94m 
 99.900%    7.03m 
 99.990%    7.07m 
 99.999%    7.10m 
100.000%    7.10m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8134.655     0.000000            1         1.00
   86966.271     0.100000         1763         1.11
  178651.135     0.200000         3522         1.25
  246284.287     0.300000         5287         1.43
  282591.231     0.400000         7048         1.67
  304611.327     0.500000         8804         2.00
  314572.799     0.550000         9709         2.22
  321650.687     0.600000        10568         2.50
  330563.583     0.650000        11449         2.86
  338952.191     0.700000        12330         3.33
  346554.367     0.750000        13215         4.00
  350748.671     0.775000        13657         4.44
  355467.263     0.800000        14104         5.00
  360710.143     0.825000        14543         5.71
  366477.311     0.850000        14968         6.67
  373817.343     0.875000        15418         8.00
  376963.071     0.887500        15632         8.89
  380633.087     0.900000        15855        10.00
  384565.247     0.912500        16070        11.43
  389545.983     0.925000        16305        13.33
  393215.999     0.937500        16511        16.00
  395575.295     0.943750        16625        17.78
  397934.591     0.950000        16728        20.00
  400556.031     0.956250        16840        22.86
  403439.615     0.962500        16949        26.67
  406323.199     0.968750        17063        32.00
  407633.919     0.971875        17114        35.56
  409206.783     0.975000        17172        40.00
  411041.791     0.978125        17228        45.71
  412352.511     0.981250        17283        53.33
  413925.375     0.984375        17335        64.00
  414449.663     0.985938        17362        71.11
  415236.095     0.987500        17391        80.00
  416022.527     0.989062        17415        91.43
  416808.959     0.990625        17452       106.67
  417333.247     0.992188        17473       128.00
  417857.535     0.992969        17490       142.22
  418119.679     0.993750        17497       160.00
  418906.111     0.994531        17521       182.86
  419168.255     0.995313        17534       213.33
  419430.399     0.996094        17541       256.00
  419692.543     0.996484        17551       284.44
  419954.687     0.996875        17561       320.00
  419954.687     0.997266        17561       365.71
  420216.831     0.997656        17566       426.67
  420741.119     0.998047        17573       512.00
  421003.263     0.998242        17582       568.89
  421003.263     0.998437        17582       640.00
  421265.407     0.998633        17587       731.43
  421265.407     0.998828        17587       853.33
  421789.695     0.999023        17592      1024.00
  421789.695     0.999121        17592      1137.78
  422051.839     0.999219        17595      1280.00
  422051.839     0.999316        17595      1462.86
  422576.127     0.999414        17599      1706.67
  422576.127     0.999512        17599      2048.00
  422838.271     0.999561        17601      2275.56
  422838.271     0.999609        17601      2560.00
  422838.271     0.999658        17601      2925.71
  423362.559     0.999707        17602      3413.33
  424148.991     0.999756        17604      4096.00
  424148.991     0.999780        17604      4551.11
  424148.991     0.999805        17604      5120.00
  424148.991     0.999829        17604      5851.43
  424411.135     0.999854        17606      6826.67
  424411.135     0.999878        17606      8192.00
  424411.135     0.999890        17606      9102.22
  424411.135     0.999902        17606     10240.00
  424411.135     0.999915        17606     11702.86
  424411.135     0.999927        17606     13653.33
  424411.135     0.999939        17606     16384.00
  426246.143     0.999945        17607     18204.44
  426246.143     1.000000        17607          inf
#[Mean    =   271022.476, StdDeviation   =   106125.838]
#[Max     =   425984.000, Total count    =        17607]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17815 requests in 10.00m, 182.68MB read
  Socket errors: connect 0, read 0, write 0, timeout 12558
Requests/sec:     29.69
Transfer/sec:    311.72KB